/*
 * motor_cmd.h
 *
 *  Created on: Mar 2, 2026
 *      Author: Vahid.Sabouhi
 */

#ifndef INC_MOTOR_CMD_H_
#define INC_MOTOR_CMD_H_
/*----------------------------------------------------------------------------*/
#include <stdint.h>
#include "can_app.h"
/*----------------------------------------------------------------------------*/
#define CMD_BASE_ID  0x300
/*----------------------------------------------------------------------------*/
typedef enum {
  MOTOR_CMD_STOP_ALL   = 0x01,
  MOTOR_CMD_STOP_ONE   = 0x02,
  MOTOR_CMD_MOVE_ONE   = 0x03,
  MOTOR_CMD_MOVE_MASK  = 0x04,
  MOTOR_CMD_SET_SPEED  = 0x05
} motor_cmd_id_t;

/*----------------------------------------------------------------------------*/


/*----------------------------------------------------------------------------*/

/**
 * فریم CAN را parse می‌کند و API موتور را صدا می‌زند.
 */
void motor_cmd_dispatch(const CAN_Frame_t* f, uint8_t node_id);

/*----------------------------------------------------------------------------*/


/*----------------------------------------------------------------------------*/


#endif /* INC_MOTOR_CMD_H_ */
